
const requiredList={
  'OLEV': {
    '학사식당': {
      출발: 45,
      도착: 59 
    },
    '스포츠 컴플렉스': 46,
    '창의학습관': 48,
    '파팔라도 메디컬센터': 51,
    '나노종합기술원': 52,
    '정문': 53,
    '오리연못': {   
      출발: 54,
      도착: 54
    },
    '교육지원동':  55,
    '나눔관': 56,
    '희망, 다솜관': 57
    // '학사식당(도착)': 59
  },
  
  '문지셔틀':{
    // '문지 출발': 20,
    '화암 기숙사': {
      출발: 30,
      도착:90
    },
    '문지 캠퍼스': {
      출발: 40,
      도착: 80
    },
    '로덴하우스 앞': 44,
    '본교': 60,
    '교수아파트 앞':75,
    // '문지 캠퍼스': 80,
    // '화암 기숙사': 90
    // '문지 도착': 100
  },
  
  '월평셔틀':{
    '영빈관':{
      출발: 5,
      도착: 46
    }, 
    '대강당':{
      출발: 6,
      도착: 45
    } ,
    '본관': {
      출발: 8,
      도착: 44
  },
    '오리연못': {
      출발: 9,
      도착: 43
    },
    '충대앞': 15,
    '월평역 1번출구': 20,
    '갤러리아': 25,
    '정부청사시외버스': 32,
    '월평역 3번출구': 40,
    // '오리연못도': 43,
    // '본관도': 44,
    // '대강당도': 45,
    // '영빈관도': 46
  }
  
};

exports.requiredList = requiredList;